# YOLO11-Wavelet Parallel
# Pendekatan Ekstraksi Tepi Paralel tanpa Merusak Backbone Semantic

nc: 1
scales:
  n: [0.50, 0.25, 1024]

backbone:
  # Backbone YOLO11 Standar (Tidak ada DWT yang mengganggu proses belajar spatial dasar)
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]] # 2
  
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 4
  
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, C3k2, [512, True]]      # 6
  
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 2, C2PSA, [1024]]          # 10

  # === WAVELET PARALLEL EXTRACTORS ===
  # Args: [c1, c2, use_dsa]
  # DWT otomatis downsample resolusi sebanyak 2x.

  # W1: Ekstrak ujung/tepi dari P4 (H/16) -> (H/32). c1=512, c2=1024
  - [6, 1, WaveletDetailBlock, [512, 1024, True]]  # 11
  
  # W2: Ekstrak ujung/tepi dari P3 (H/8)  -> (H/16). c1=256, c2=512
  - [4, 1, WaveletDetailBlock, [256, 512, True]]   # 12
  
  # W3: Ekstrak ujung/tepi dari P2 (H/4)  -> (H/8).  c1=128, c2=256
  - [2, 1, WaveletDetailBlock, [128, 256, True]]   # 13

head:
  # =======================================================
  # Top-Down FPN dengan Injeksi Detail Wavelet
  # =======================================================
  - [10, 1, nn.Upsample, [None, 2, 'nearest']] # 14: P5 upsample ke P4
  
  # Inject W2 (detail wavelet P3->P4) ke Concat ini!
  - [[-1, 6, 12], 1, Concat, [1]]  # 15: Concat P5_up + P4_backbone + W2_detail
  - [-1, 2, C3k2, [512, False]]    # 16: P4 head
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17: P4 upsample ke P3
  
  # Inject W3 (detail wavelet P2->P3) ke Concat ini!
  - [[-1, 4, 13], 1, Concat, [1]]  # 18: Concat P4_up + P3_backbone + W3_detail
  - [-1, 2, C3k2, [256, False]]    # 19: P3 head (small detect)

  # =======================================================
  # Bottom-Up PANet
  # =======================================================
  - [-1, 1, Conv, [256, 3, 2]]     # 20: P3 downsample ke P4
  - [[-1, 16], 1, Concat, [1]]     # 21: Concat P4
  - [-1, 2, C3k2, [512, False]]    # 22: P4 head (medium detect)

  - [-1, 1, Conv, [512, 3, 2]]     # 23: P4 downsample ke P5
  
  # Di ujung terdalam ini, kita bisa inject W1 (detail wavelet P4->P5) 
  - [[-1, 10, 11], 1, Concat, [1]] # 24: Concat P5_down + P5_backbone + W1_detail
  - [-1, 2, C3k2, [1024, True]]    # 25: P5 head (large detect)

  - [[19, 22, 25], 1, Detect, [nc]] # 26: Detections (P3, P4, P5)
